{
	"words": [
	  {
		"id": 0,
		"start": "110",
		"end": "600",
		"text": "Kalyan Jhabakh\nPl refer to Pages 140 to 164, 150 to 164, 150. to 164 of Ex C-7. Is this your whole list of the all the permanent employees of the claimant? \n\nSaral Talwar\nThis is the list of employees. Yes.\n\nKalyan Jhabakh\nWhen and by whom was this list prepared?\n\nSaral Talwar\nThis list was obviously prepared by our accounts department from the salary slips and everything that we have submitted.\n\nKalyan Jhabakh\nWhen was this list prepared?\n\nSaral Talwar\nI don't know the exact dates, not written here so, I don't know the exact date. I'll have to check and get back.\n\nKalyan Jhabakh\n What do you mean by permanent employees? Can you tell this honourable tribunal?\n\nSaral Talwar\nA permanent employee for us is somebody, who has been working with us on a permanent role and gets a salary either in cash or by cheque.\n\nJustice Kannan, Arbitrator\nWhat would the permanent role mean?\n\nSaral Talwar\nPermanent means that he's on our rolls.\n\nJustice Kannan, Arbitrator\nYou give them a tenure.\n\nSaral Talwar\nWe give them a tenure; I mean properly we give him an appointment letter and that appointment letter is valid till he's working with us.\n\nKalyan Jhabakh\n With reference to C7, are you aware of how many persons were working with the claimant company as of the date of termination?\n\nSaral Talwar\nApproximately I think about 800 odd people.\n\nKalyan Jhabakh\nDo I take it that you are personally not aware of who all are the employees are there and only someone else in your claimant company will be able to say that?\n\nSaral Talwar\nSee, I would obviously not know the exact numbers, because it will be done by the accounts department. But I would know approximately how many people are there and who's there. I know the people personally but would not exactly know the number.\n\nKalyan Jhabakh\n Have the appointment letters of all these persons shown in exhibit C17 filed before this honourable tribunal and can you produce them?\n\nSaral Talwar\nNo, it has not been filed, but it can be produced.\n\nKalyan Jhabakh\n Have you filed the resignation letters or the termination letters of any of these employees before this honourable tribunal?\n\nKalyan Jhabakh\n No, we have not filed the termination letter or resignation letters, but again the same thing can be filed if required.\n\nKalyan Jhabakh\n Have you filed any documents or pleaded as to when the alleged statutory dues of these employees were paid?\n\nSaral Talwar\nBank statements. Yes, we have submitted the document, exhibit number C 27. I think that contains all the payments that were made to employees.\n\nKalyan Jhabakh\n Apart from exhibit C27, have you filed any other documents to show payment of the statutory dues to the employees?\n\nJustice Kannan, Arbitrator\nStatutory dues, it could be a provident fund contribution of what you make, if there is a person who is resigning and going, gratuity of what you would be entitled to, things like that what will be evident through returns we give to public authorities.\n\nSaral Talwar\nIt is part of the C27. All list of exact payments that have been made, which also include statutory payments. Apart from that, in the previous years, the same statutory payments are there in the balance sheet, which has also been filed as part of C26.\n\nKalyan Jhabakh\n Please see exhibit C17 page 242, Who has prepared the statement and has any breakup in support of this statement been filed along with the claim petition?\n\nSaral Talwar\nThis data has been prepared by our accounts department and it is basing on the data submitted in the balance sheets of the previous years. Same thing corresponds with the same data that already has been filed in C26.\n\nKalyan Jhabakh\n In respect of the employees referred to earlier, how many of the employees did you terminate and how many resigned from the job as on the date of termination?\n\nSaral Talwar\nPost termination, we have not terminated any employee. They all started leaving as they were getting an opportunity and as and when we got clarity that we will not be continuing.\n\nKalyan Jhabakh\n Have you filed copies of the resignation letters of any of these employees?\n\nSaral Talwar\nNo, we have not filed the copies, but can be done so in case required.\n\nKalyan Jhabakh\n Shown Exhibit C17, can you tell for which period is this amount claimed to have been paid?\n\nSaral Talwar\nAll these amounts have been calculated as on date of termination.\n\nJustice Kannan, Arbitrator\nWhich date?\n\nSaral Talwar\nThat is about August what I think was 12th or something, the date of termination letter by Hyundai."
	  },
	  {
		"id": 1,
		"start": "601",
		"end": "1200",
		"text": "Justice Kannan, Arbitrator\nThat is as per this as you find under exhibit C17 are the amounts paid to various employees.\n\nSaral Talwar\nThat is correct sir.\n\nKalyan Jhabakh\nApart from the statement filed as C17, you have not filed any individual documents and particulars of to whom and when these payments were made?\n\nSaral Talwar\nThey are not filed. The entire employee-wise each and every employee payment and detail has been filed in C27.\n\nKalyan Jhabakh\nPlease see serial number 6 in exhibit C17, page 242, for which period and when were the saleseffected and by whom that the incentive was paid?\n\nSaral Talwar\nThese incentives could be from a period of anywhere between three months to one year before the date of termination, because different incentives are paid up to different dates. So, this was as on that day this much was payable.\n\nKalyan Jhabakh\nAm I right to say that it is on the capacity of each salesperson in spite of being in the same showroom that he gets different incentives?\n\nSaral Talwar\nYeah, we have different slabs and different rates for incentives. So, which is announced in advance. And so, depending on his sale and capacity and his performance, the incentives are paid.\n\nKalyan Jhabakh\nI put it to you, that exhibit C17 has been fabricated only for the purposes of the case and without any supportives.\n\nSaral Talwar\nI completely deny the supportive statements are in the Balance Sheets given in C26.\n\nKalyan Jhabakh\nI put it to you that these benefits have not been paid and that is why you have not provided for the same in the Balance Sheet as per AS15 of the accounting standards, as stated therein.\n\nSaral Talwar\nThese all would form part of the balance sheet of the year 19-20, which we have not yet finalized.Some of them are, I think most of them, because most employees have gone. In fact, as I saidthe payment details are being given in C27.\n\nKalyan Jhabakh\nCan you tell this Honourable Tribunal what exhibit C-23 is?\n\nSaral Talwar\nThis is the bank statements showing us a payment of salaries, for those months. January 2020,this is how we upload, and this is the enclosure that goes with it, for the payment of salaries.\n\nKalyan Jhabakh\nAre you saying pages 1 to pages 6 form part of the same document?\n\nSaral Talwar\nYes, they from the part of the documents.\n\nKalyan Jhabakh\nIn respect of the alleged 700 employees, when and have you in writing sent the list to the respondent at any point of time?\n\nJustice Kannan, Arbitrator\nAre you required to send the details of employees with HMI?\n\nSaral Talwar\nWe don't have to send any list to them, because automatically all the employees except the back office, are uploaded onto the Hyundai system. So, they are aware of each and every employee with their name, date of joining. Everything is available in the Hyundai system except only the back office and support employees, which are not part of the list available with Hyundai. Every salesman, every sales manager, every workshop staff, every technician, probably not the helpers  and the you know the office workers and stuff apart from that, at least 70-80% of the employees are uploaded onto the Hyundai system on a regular basis. So, Hyundai is aware of the entire list. We don't have to send anything physically, because we are all connected."
	  },
	  {
		"id": 2,
		"start": "1200",
		"end": "1744",
		"text": "Kalyan Jhabakh\nI put it to you, that the manpower requirement is uniform for all the dealers and that is why a common email had been sent to all the dealers, showing the manpower available and the shortfalls also, which included the claimant.\n\nSaral Talwar\nYes, there is a manpower requirement chart by Hyundai, I mean partially true that yes Hyundai has certain norms as per the norms, they keep making this chart and they keep sending it to all dealers. And if you notice any big dealer, none of them would ever meet that norm. It maybe some small dealers in some small towns may be able to meet these are expectations, what Hyundai sets and we are supposed to try to move towards it, it is not a requirement. So, if you see whether it is the top leaders Kun, Laxmi who are supposed to be the best dealers and still continue today also, they also have 60% achievement and so, do we. So, this is an expectation versus the scenario mail that is sent on a regular basis.\n\nJustice Kannan, Arbitrator\nThe question is, is there any uniform requirement across the board to all dealers?\n\nSaral Talwar\nThat is what I was saying. There is a uniform requirement by Hyundai. Which is an estimate, which approximately target more to say.\n\nKalyan Jhabakh\nAs per this exhibit, have you disputed the fact that from the expected quantum of workers required for manning the showrooms of the claimant, only 60% of the manpower was available?\n\nSaral Talwar\nI deny this, first of all this is not to do with the showroom. It is a very specific particular manpower requirement of some seven people, of which we have four people or something which is 60%.  So, it is not my overall manpower requirement. The total requirement itself, if you see, I have three people and I've shown as 60% requirement. So, my entire requirement is not five people to run a show. This particular exhibit is for a particular I think it's for some, must be for some particular mail, I'll have to check for, It is for support man power, it is not for sales man power. So, as I said these are very, very specific mails for a particular specific region. I think this pertains to CCM, MCC, as to how many people we have sort of five I have three people. So it's going 60%. That does not mean that I have only 60% staff.\n\nKalyan Jhabakh\nIs it true that in the years of 2019, late 2019 and early 2020, there had been a lot of attrition as far as the claimant’s staff is concerned and which had also been pointed out by the respondent?\n\nSaral Talwar\nWell, partially true because at that time. There was a lot of attrition overall in Hyderabad among all dealerships, which is again a very normal practice when new dealerships or new manufacturers come into the market and that time MG and Kia had recently come into the market.\n\nKalyan Jhabakh\nPlease take exhibit C27. Can you tell this honourable tribunal what is exhibit C27?\n\nSaral Talwar\nC27 is a statement of all the payment of salaries and other dues to the employees, all the way from January, I think. Literally from I think receiving the show cause notice till January till we continued. Here I could just add, this was actually submitted after your reply, counter reply came that we had not submitted any proof of payment of salaries. So, this was submitted as a reply to that.\n\nKalyan Jhabakh\nHas exhibit C27 been certified by the bank?\n\nSaral Talwar\nThe same has been downloaded straight from the bank website and the same can be verified at any given point of time."
	  },
	  {
		"id": 3,
		"start": "1815",
		"end": "2375",
		"text": "Kalyan Jhabakh\nWho was the person who reported this on behalf of the claimant?\n\nSaral Talwar\nThis was downloaded using my username and ID, probably when I was sitting in front and my person downloaded, manual work was not done by me. But it's been downloaded with my username and ID.\n\nJustice Kannan, Arbitrator\nIt has been taken out of your computer.\n\nSaral Talwar\nFrom my persons computer, but I put the username and id and I gave access to the files, and it was downloaded together. If you see the ID marker, I mean, I use that's my father's name. So, I use that username ID.\n\nJustice Kannan, Arbitrator\nThe name Sunil as you find in this document under exhibit C27. He has used that name, is your father's name?\n\nSaral Talwar\nYes.\n\nKalyan Jhabakh\nI put it to you that since there is no affidavit under Section 65 B, this document cannot be relied upon.\n\nSaral Talwar\nAffidavit, we can submit it's not there, we can submit it immediately not a problem. Tomorrow we'll have it submitted.\n\nKalyan Jhabakh\nIn exhibit P 27, can you tell what are the pages 108 to 182?\n\nSaral Talwar\nThis refers to all the cash payments to employees whose salaries are paid in cash, which are less than 15,000. As a practice for a less than 15,000 salaries we pay by cash, above 15,000, we do bank transfers. So, these are the virtual copies signed by the employees when they receive their salaries. We had about a 10 member accounts department, which is finally approved. The final approver is me. But the account department, prepares it, including the workshops; actually, we have a lot more than 18 people in the department, I think.\n\nKalyan Jhabakh\nWhen are these salaries paid?\n\nSaral Talwar\nNormally, we pay our salaries anywhere between 7th to 15th of every month. That's a normal salary payment dates, I mean, next month, the preceding month.\n\nKalyan Jhabakh\nTo how many employees, as on the date of termination was payment being made in cash?\n\nSaral Talwar\nExact numbers, it’s all in, the entire thing is completely here.\n\nKalyan Jhabakh\nI put it to you that in none of these cash receipts which is for more than Rs. 5,000, have you even affixed the revenue stamp on any of them. I put it to you that these documents had been fabricated for the purposes of the case and that is why they do not even find a stamp receipt on payments more than Rs. 5,000.\n\nSaral Talwar\nI completely deny, all these reasons are 100% genuine and the same can be verified anytime?\n\nKalyan Jhabakh\nTwo names K Raju, mentioned are they the same person.\n\nJustice Kannan, Arbitrator\nK. Raju, and K. Raju it says in both. One it says cash salary for the month of November 2020. This is cash salary paid for the month of December 2020 that is 5,001 in another 10,000. And then in another place salary for the month of November is 9,634. And this it says for the December it is 1,500. So, they are variable figures.\n\nSaral Talwar\nNo, I don't think it would be the same person, because it's clearly seen Raju denter here, and doesn't say denter here. So must be some other person here. Plus, the denters actually they don't have a fixed salary. Denters are paid an amount depending on amount for the work schedule. So denter’s are paid as per the amount of work they do they don't get a fixed salary. So, every month denter’s salary can change. There is a percentage of the income that we get is what is paid to the denter’s. So that is how denter’s salaries are paid.\n\nKalyan Jhabakh\nAgain coming back to page 118, what is the significance of the number assigned to K. Raju?\n\nSaral Talwar\nI am not sure; I will have to check and get back."
	  },
	  {
		"id": 4,
		"start": "2398",
		"end": "2900",
		"text": "Kalyan Jhabakh\nI put it to you that you had never filed these vouchers, and all these have been prepared by your staff for the purposes of the case.\n\nSaral Talwar\nI completely deny the same. These vouchers were already existing and the same had been made copies. I may add figures corresponding to the previous years also the figures have been consistent in terms of this amount of salaries and the breakup in the balance sheets. So, it could not have been made only for the sake of the case.\n\nKalyan Jhabakh\nPlease see page number 126 and page number 125 that is serial number 42 and 44. I put it to you these were fabricated and that is why both the receipts carry the date of 12-01-2021 given to the same person, Joseph security.\n\nSaral Talwar\nProbably for some reason, his salary wouldn't have been paid for December and so that's why probably could have been paid together for two months for him we'll have to check and get back specifically on that. Thus happened, it could be various reasons we'll have to get into it and specifically want I could find out in reply why this happened.\n\nKalyan Jhabakh\nI put it to you that unless and until you produce all the appointment letters, all the resignation letters or termination letters, you will never be able to tell the exact number of persons as on the date of termination, which were employed by the claimant.\n\nSaral Talwar\nSo, in case you would like, we can actually have the whole thing submitted exact.\n\nJustice Kannan, Arbitrator\nYou accept what he says or no?\n\nSaral Talwar\nI mean not necessary because it is clearly there. I don't accept that.\n\nJustice Kannan, Arbitrator\nYou accept what he says or no? I don't admit it, if you want those things, if you think that that's important, we can file those things.\n\nKalyan Jhabakh\nWith regard to gratuity, if the employee has worked with the claimant only for more than five years, only then gratuity is payable.\n\nSaral Talwar\nThat is correct,as per the law, I think five years or four years whatever is the law. Yeah, I think five years as per the gratuity law, whatever is applicable.\n\nKalyan Jhabakh\nHave you filed any proof before this honourable tribunal to show that these payments were made to the employees?\n\nSaral Talwar\nNo, specifically for gratuity, I don't think we have submitted a specific this thing on the gratuity.\n\nKalyan Jhabakh\nI put it to you that only in view of the earlier services rendered by the employees to the claimant, the claimant alone is bound to pay the gratuity and the respondent is in no way liable for the same.\n\nSaral Talwar\nGratuity is payable at any given point of time by us, but we don't actually have to pay it until the employee leaves. We were forced to make the employees leave. So, because of that, we feel that the respondent has to compensate for us.\n\nKalyan Jhabakh\nApart from exhibit C17, have you filed any other proof that you have made payment of the employee compensation for a sum of rupees 2 crores as claimed?\n\nSaral Talwar\nYes, the details of that is there in C27 is exactly what is included in towards the three months post termination or post resignation. Kalyan Jhabakh\nI put it to you that even the other claims made by you in the exhibit C17 are either way payable only by the claimant and the respondent is in no way liable for the same?\n\nSaral Talwar\nI deny this completely, because this was paid assuming that we will get the dealership back, so I continue to pay them without selling or doing business during that period."
	  },
	  {
		"id": 5,
		"start": "2947",
		"end": "3482",
		"text": "Kalyan Jhabakh\nIn respect of dealership code number 5201, SP road, the same expired on 29/07/2021. Is it not? Saral TalwarYou're saying the dealership agreement expiring July 2021. Probably, I’ve to check that. Kalyan JhabakhI put it to you that in respect of this dealership apart from the other reasons since it had not been renewed, you are not entitled to any claim in this regard.\n\nSaral Talwar\nAssuming the date I've just checked but if it is July 2021, the termination happened in August 2020. And like so, I mean I am 100% eligible for the claim, because as said earlier all the renewals used to happen automatically, that it was always assumed that once the time comes the new renewal agreement automatically comes without even applying for it. So, the fact that it was expiring doesn't change anything.\n\nKalyan Jhabakh\nPlease see para 35 of your proof of affidavit. I put it to you that even the amount shown in the tabular column are all cooked up for the purposes of the case and for the claim statement and not borne out by records.\n\nSaral Talwar\nI completely deny this. These records have been submitted, all balance sheets have been submitted up to the year 2019, 2018-19 as part of the sequence.\n\nKalyan Jhabakh\nPlease see para 35 of your proof of affidavit, I put it to you that when you have always been taking the stand that during the period 2018-19. there has been a downtrend in the sale. It could not have been double the profit as claimed by you in paragraph 35 for the year 18-19.\n\nSaral Talwar\nI deny this statement, because the profit does not have to do with the sales at all. It completely depends on how much discount that we dealers have to give from our pockets and what kind of competition is there within the dealers. So, during that time, there are times when we dealers are in good cooperation with each other. So, the discounts are controlled and all of us make more money.\nWhen new dealers come in or there is some discord between our dealers, each dealer starts giving exorbitant discounts and the dealership loses money, so dealership will lose sometimes a lot of money if you sell more cars but make more money if you sell less cars. It's a pure matter of how much money we are retaining rather than how many vehicles we are selling.\n\nKalyan Jhabakh\nPage Number 244, Exhibit C28. Exhibit C9, C19. Apart from Exhibit C19, I put it you, that you\n\nhave not filed any documents to substantiate that these payments were made by the claimant?\n\nSaral Talwar\nI deny the statement. We have submitted the balance sheets that shows the same rents for the previous years. And also, I think we have submitted the copy of the lease deeds in C28, we have submitted all the lease deed copies that clearly shows the amount of rents that are being paid under the contracts that we have with all the tenants currently, in C28"
	  },
	  {
		"id": 6,
		"start": "3586",
		"end": "4005",
		"text": "Kalyan Jhabakh\nPlease come to page number 113. In respect of the premises at Nampally, the lease rental is only 22,000 per month, whereas you have claimed payment of Rupees 4,46,000 per month in Exhibit C9.\n\nSaral Talwar\nAt Nampally,we were paying him a low rent plus a share of the turnover of the dealership of the particular workshop. So, that was the understanding that we had with the Nampally landlord.\n\nJustice Kannan, Arbitrator\nDoes it talk about payment turnover or share in the turnover in the lease here, sir?\n\nSaral Talwar\nI'm just trying to see here, sir. I think there was a separate document done for that, probably I don't think it was mentioned and there is a separate agreement that we had with him. So, the same will be submitted to you, sir.\n\nJustice Kannan, Arbitrator\nNo, but he was asking something else. He is referring to, therefore, you would say apart from the rent was the share of the turnover and that is what is accounting for the larger amount than 22,000 rupees.\n\nSaral Talwar\nYes, that is correct. So, this is what the figure that we have given is what we have been paying them and not only this year’s, even the previous year's balance sheet you may cross check on these amounts and the amounts for tally.\n\nKalyan Jhabakh\nFrom the answer given earlier, is it correct that in respect of Nampally, you still continue to earn huge profits and make the payment as stated in Exhibit C7?\n\nJustice Kannan, Arbitrator\nDo you continue to make profit in order of that because only for a higher turnover, you are providing per share? So, are you getting a large turnover even during the period 2018-19 to have paid that much of amount of what you have claimed there in C19?\n\nSaral Talwar\nYes, turnover was happening because the workshops were continuing. So, it was not on profit,but on turnover. So, we were servicing the vehicles. So, this was paid to him on turnover irrespective of the profit.\n\nJustice Kannan, Arbitrator\nTurnover has nothing to do with the sales of vehicles taking place.\n\nSaral Talwar\nYes sir. This is in the workshop, sir. Our vehicles are serviced at that particular workshop,whatever the total turnover is there. Because it was in a very prime area, rents are very huge there, so, instead of paying rent, we decided on a revenue share model rather than rent.\n\nKalyan Jhabakh\nI put it to you that similarly in respect of Tolichowki and Madhapur, the amounts claimed by you in Exhibit C19 and the document C28 do not tally and that is why you have cooked up this Exhibit C19 for the purposes of the case.\n\nSaral Talwar\nI completely deny. The amounts are 100% tallying, probably the difference would be GST TDS that has to be reduced from the rent, this is the amount that we actually pay, and the agreement would talk about only the basic rent and the amount that you see in C19 is the final amount payable, this would be an additional 18% GST and deduction of TDS.\n\nJustice Kannan, Arbitrator\nDo we have in respect of any other person from rent, where you have revenue share or where the turnover is shared, apart from the previous example, which you said?\n\nSaral Talwar\nNo, sir. Nampally is the only one that we have.\n\nKalyan Jhabakh\nShown Exhibit R1, internal page number five. Is this the joint family tree that you made a representation to the respondent when you wanted to take up the Erragadda workshop showroom?\n\nSaral Talwar\nYeah, this is my entire family. Yes.\n\nKalyan Jhabakh\nIs it correct that even today you all are as a joint family group?\n\nSaral Talwar\nNo, it is not correct. We are no longer together since almost last four years. In fact, that time also we were not together. We were just asked to submit our family whatever branches we have. If you see Saket and me, we were always different. I had nothing to do with his business and he had nothing to do with my business, except the fact that both of us are sons of the same father."
	  },
	  {
		"id": 7,
		"start": "4110",
		"end": "4685",
		"text": "Kalyan Jhabakh\nIn respect of your claim for rent and maintenance post-termination, I put it to you that you have not filed any proof of payment of the said sums, and you're not entitled for the same.\n\nSaral Talwar\nNo, I deny it. We have filed it; the same thing can be found as I said in the balance sheets that we have given that clearly shows that how much rent has been paid to all the landlords over the period of time.\n\nKalyan Jhabakh\nI put it to you that after the termination, it was the claimant’s own choice to maintain or to retain the showrooms or workshop and hence the respondent is not liable in any manner for the same.\n\nSaral Talwar\nI deny this, because, as you're aware, we had gone for a stay in the Hon’ble High Court of Madras, and in case the stay was granted and the termination would have been revoked, and had we left these facilities, we could not have even thought of getting back into the dealership. So, we had no choice but to wait for the Hon’ble High Court judgment. And so, we had to continue paying the rents, salaries and everything to everyone, hoping that we would be able to get back and retain the dealership.\n\nJustice Kannan, Arbitrator\nWhat happened in the High Court?\n\nSaral Talwar\nThe stay was finally vacated, and the Judge asked us to go for arbitration. In fact, the stay was in place almost from June, August to December end or January 1st week, I think. So, during that period is what we had to continue paying. We could not leave the premises nor the staff.\n\nKalyan Jhabakh\nThe claimant has retained certain workshops and is still running the workshops. Hence, in respect of all of them, you have deliberately not given who are the employees retained, what is the basis  and that is why you have not filed all the appointment letters and/or the resignation or termination letters of the employees.\n\nSaral Talwar\nWhat we have claimed from you, is only for the period when the stay was there, and until the stay got vacated in January, is when we have asked to claim. After that, we have not claimed, neither the rent nor the salaries. The period which we are claiming is only 3 to 6 months from post the termination, which was till the stay was in place, during which period we could not neither function nor could we close. So, that is why, later today, we are continuing as a small multi-brand dealership not as a Hyundai dealership.\n\nJustice Kannan, Arbitrator\nThat is another part of the question, which he was asking. It's not merely the rentals he's talking about, the issue of who was terminated, who was retained in the job. All those details will be known only through appointment letters and resignation letters. They have not been filed, which you said you have not done. They're not being filed only because this is manually done and therefore, we have not filed it yet, he is saying.\n\nSaral Talwar\nNo, I deny that and as I've already said we will file the thing immediately, sir.\n\nKalyan Jhabakh\nNo details have been given apart from the alleged balance sheet in respect of exhibit C20 that is seven lakhs per month for repairs and maintenance. This has been cooked up only for the purposes of the claim.\n\nSaral Talwar\nI deny that. This information, again the repairs and maintenance costs can clearly be seen on the previous years also in all the balance sheets submitted. In fact, the average is normally 12 to 15 lakhs a month. During this period since activity had gone down during post-termination, our expenses were only around seven lakhs, which is what we have actually claimed, which will be the actual expenses; otherwise, if you see the previous years, our normal repair and maintenance costs for every year is approximately 1.4 to 1.5 crores a year.\n\nKalyan Jhabakh\nI put it to you, since it has not been specifically pleaded as to what was the repair and maintenance done, no documents filed, you're entitled to the set claim.\n\nSaral Talwar\nI deny the same. The same can be easily seen from the balance sheets and the same is available.\n\nKalyan Jhabakh\nPlease see annexure C21, page 246 247. I put it to you, that none of these accessories or stock had been purchased from the OE and it was purchased from a separate entity and hence you're not entitled to this claim."
	  },
	  {
		"id": 8,
		"start": "4700",
		"end": "5300",
		"text": "Saral Talwar\nThe exhibits that we have given are actually the ones that we have purchased from them and on page 247, the amount given is 100% purchased from Hyundai and these figures are from the Hyundai system of stock that was there on the date of closing. So, all these figures are already available with Hyundai because it is from the Hyundai software that each and every part is fed into the software.\n\nJustice Kannan, Arbitrator\n The accessories, what we're saying, they pertain to Hyundai cars only, is that what you're saying?\n\nSaral Talwar\nYes, and as far as the spare parts are concerned those are 100% from the system and the figures quoted here are from Hyundai system itself.\n\nKalyan Jhabakh\n I put it to you, that all these accessories and stocks had been purchased by the claimant from one M/s Mobis India Limited, a separate legal entity.\n\nSaral Talwar\nIt is true that these have been purchased by an entity called Mobis India limited, but I would like to put it on record here that I have no agreement or contract, or any piece of paper I received from Mobis India, that they will be supplying. All my agreements and contracts have been with Hyundai Motors and Hyundai sent us a mail that subsequent to our contract, Mobis will supply these things to you. The mail is there, which has been submitted.\n\nJustice Kannan, Arbitrator\nAll these accessories, which you have availed from Hyundai, they have been availed by you under the instructions of Hyundai, who have put Mobis as an entity which will support you.\n\nSaral Talwar\nYes, there is no direct agreement between us and Mobis whatsoever in the last so many years of Mobis coming into India, so it's just that they're trying to just, you know I mean they push it onto one of the sister concerns and pass it off, but it has nothing for us. It is nothing but Hyundai. As we have never even entered into a contract with Mobis till date.\n\nJustice Kannan, Arbitrator\nAre you making payment? Who will be making payments?\n\nSaral Talwar\nHyundai told us to make payment to Mobis and take parts from them.\n\nKalyan Jhabakh\n Also, please see page 246. I put it to you, that even as per page number 246, exhibit C21, the amount comes only to Rs. 1,68,850 and not the sum of Rs. 21 lakhs as claimed by you, in item number 10 of your claim.\n\nSaral Talwar\n The amount of 21 lakhs is correct, but I have a feeling there's something missing in this sheet. I probably will get back to you. I don't think this is updated.\n\nJustice Kannan, Arbitrator\nYou, therefore, agree that there is a discrepancy between the aggregate of what you see under C21 to what is claimed in the claim statement. You suspect that some documents are missing, we have omitted to file, is that right?\n\nSaral Talwar\nThat is correct, sir. And 21 lakhs amount is for sure.\n\nJustice Kannan, Arbitrator\nThey have no details to document this also?\n\nSaral Talwar\nAbsolutely, sir.\n\nKalyan Jhabakh\n Please see Exhibit C29, page five. I put it to you, that the claimant had always been placing orders in respect of spares and accessories directly on Mobis India Limited and had independent dealing with them. And that had nothing to do with the sales team of the respondent.\n\nSaral Talwar\nI completely deny this. We have had no agreement with the respondent company. I would like to take your attention to, in fact, we can actually refer to the same page that you were talking about. We straightaway get a mail like this from Mobis saying that because we are a dealer, a Mobis dealer code has been created for us. Same thing can be seen from page number four also. We straightaway get a mail from the parts department. And they tell us that this code has been created and we can now go ahead and start ordering parts.\n\nKalyan Jhabakh\nWith respect to these spares and accessories has the claimant ever been given any target or list of goods, which are to be purchased or was it an independent call of the claimant to purchase the same.\n\nSaral Talwar\nThere was a target set by Hyundai, which depending on the number of vehicles that we serviced, we were supposed to order a certain amount of parts per vehicle service as per our previous history and records.\n\nKalyan Jhabakh\nIn respect of Exhibit C22. When and where were these accessories or spares sold, if at all?"
	  },
	  {
		"id": 9,
		"start": "5300",
		"end": "5930",
		"text": "Saral Talwar\nAll accessories were sold mostly at the showrooms and the spare parts were sold at the workshops. Are you referring to normal sales or are you referring to specifically the parts that were left with us?\n\nKalyan Jhabakh\nI put it to you, that in the absence of you producing any records for the sales made as per Exhibit C21 and C22, you are not entitled for the set claim.\n\nSaral Talwar\nI completely deny this.\n\nJustice Kannan, Arbitrator\nLet me understand the difference between the accessories you're talking about and the spares you're talking about. The accessories are something which is optional and you don't require that at all. And, therefore, that is seen as something, which a person purchases it from the showroom. And if it's a spare, it's always at the workshop. A spare is something where you need a replacement and things, that's what they’re saying. And what do you do about an accessory, which is purchased from the showroom, which requires a change. For instance, you have some  fancy fitting there and that that goes bust, something happens. Is it a spare part then or will it be still an accessory, which will be purchased from the showroom?\n\nSaral Talwar\nAll servicing will be done at the workshop, sir, even if it's an accessory and it goes bad. The customer comes to a workshop and at the workshop itself, we replace it and because even to the showroom, the order goes from the workshop only because all orders for accessories and parts is made by the workshop to the Mobis India and all the parts are received at the workshop and whatever is to be sent to the showroom is sent by the workshop. So, the workshop parts department and the workshop team only handle all the accessories and parts. Mobis for their own internal working, Hyundai has offloaded parts business through a company called Mobis, which has their own sister concern and in fact, in our workshop, we actually have two systems, which actually makes it very difficult for us to function.\nNow as a customer, when you come to us and we raise a job card, you give me a vehicle for servicing, the job card is raised in the Hyundai system. In the job card, a particular part is required, and that part requirement is raised by the Hyundai system, sent to the Mobis system. Mobis system issues the parts and again comes into the Hyundai system. Hyundai system builds the part to the customer, but the bill to the customer goes only from the Hyundai system. So, both the systems are completely integrated for reasons best known to Hyundai, they have just divided it and offloaded to another company, which does the part sale and once again, I would like to repeat, that there has never been any contract between us and Mobis, and so it's assumed that the moment a dealership or showroom or a workshop is issued, automatically we get a mail from Mobis, so they internally inform Mobis people and Mobis sends us mail that you have now been allotted a workshop, so here is your code and this is how you log in that's it. There is no LOI, no contract, and nothing given to us by Mobis.\n\nKalyan Jhabakh\nWhen according to the claimant where they first put on notice regarding the default being committed by them with regard to the inventory funding?\n\nSaral Talwar\nI think it was around the time, officially is the first mail around 2018 March. I think it must be around the same time.\n\nKalyan Jhabakh\nI put it to you that after issuance of the first notice of inventory funding gap being there, and the same not having been rectified within 30 days, Hyundai under the dealership agreement had the right to terminate your dealership agreement, even on a seven days’ notice because of the failure to rectify the defect?\n\nSaral Talwar\nWell, as per the agreement, I presume what you're saying is right. But as I said that we had, consciously decided that's something that we have to live with, and we have been continuing with it and wanted to continue it.\n\nJustice Kannan, Arbitrator\nSo, the question is, they're entitled to terminate and because of the default committed by you, they decided to terminate. Do you agree to that or not?\n\nSaral Talwar\nAs per that, then they should have terminated us in 2018. They did not. So, as per the agreement, they should have terminated us within seven days within 30 days if I was not doing it. So, the fact that they did not was that it was not a practice. For some reason, suddenly, they decided to implement it, after two years, literally, more than that.\n\nJustice Kannan, Arbitrator\nIf in the past, they had been lenient, they should continue to be lenient, or if they had the right to do so and you have no objection if the right is exercised. You won't have normally a problem about exercise of the right, but your problem is that you had been lenient in the past, why are you not trying to be suddenly trying to enforce the terms? Is that a case?\n\nSaral Talwar\nNo, sir. That's not exactly what I'm saying. What I'm saying is that they were aware that this is a common practice and almost 80% dealers, if you see today, I can put it on another channel, the 80% of dealers will have a fund gap at any given point of time if you've checked. It is a normal as I said, a minimum of 80% dealers would have a fund gap at any given time.\n\nKalyan Jhabakh\nPlease see our respondent’s documents, R45 to R47? Those are the three show-cause notices dated 24th June 2020, page number 156 to 161, Respondent’s documents. In respect of these three notices, a common reply alone had been sent on 1st July 2020, which is at page 173."
	  },
	  {
		"id": 10,
		"start": "5941",
		"end": "6530",
		"text": "\n\nSaral Talwar\nYes. This is a reply for all the three, we sent a single reply.\n\nKalyan Jhabakh\n I put it to you, that as stated in the reply notice at page 174. It was the diversion of funds from the inventory funding to the Volvo dealership that there had been a huge fund gap and financial loss for the claimant\n\nSaral Talwar\nNo. I deny the same. We have never diverted the inventory funding to the Volvo business, but what had happened was the properties that got sold, that money had to be first put there to stabilize that business or to try to save that business is what we have written. It was not the inventory funding funds that were diverted, it was whatever properties we were able to sell to bring in funds into Volvo.\n\nJustice Kannan, Arbitrator\nHave you not stated in the past when they were referring to inventory funding gap that you would sell some properties and recoup? And now, you're saying that selling property you put it to Volvo business and will that not in which case of what you're saying contradict what you were saying earlier that you would bridge the gap by selling properties. Have you said or have you never said?\n\nSaral Talwar\nNo, sir. We have said that. The earlier property is what got sold first, that money went to Volvo and balance the properties that we're going to sell that money was going to come to Hyundai, which properties did not get sold and the ones that got sold initially, those monies had first gone to Volvo because that time Hyundai was telling us you’ve already sold these, property what happened with that money, so that money had gone to Volvo and future what we had told them that this what we're selling we are going to be putting in Hyundai. Unfortunately, those sales got delayed because what happened was Volvo dealership closed in 2019. So, the moment the dealership closed, the financers wanted their money back immediately, so what we sold first we  had to first pay them off. Otherwise, they were threatening to stop all our limits of the other two companies that was the main issue.\n\nKalyan Jhabakh\nIs it true that the Talwar group is still known as one group in the city of Secunderabad and Hyderabad?\n\nSaral Talwar\nEach and every company is completely different, but maybe, you know, different. I mean, like people would totally say that, yes, like Talwar like you have Navneet (phonetic) Group in Bombay. They have close to, I think, 25 dealerships, they're eight brothers, they're all separate, but if anything happens, people say Navneet Group. So, yes, that way, all people who are in Talwar will be called as Talwar Group.\n\nJustice Kannan, Arbitrator\nThe public perception could be one of the group; but as far as you're concerned and accounting are concerned, there will be.\n\nSaral Talwar\nCompletely, no. There's no link between each other. Any money is given or taken also is purely as short-term loans or whatever and taken back and given whenever it is recorded as a proper formal, like a transaction.\n\nKalyan Jhabakh\nI put it to you, that in the absence of any document and records to show that there's been any loss of goodwill and reputation, you are not entitled to the claim under the said some.\n\nSaral Talwar\nI completely deny that, especially because of closing of Hyundai dealership, we would have had to suffer a huge amount of loss in terms of our image in the market. In fact, we had applied for a Tata Motors dealership, for which we were chosen for the final round. And we are actually passed everything including the due diligence, but it was only because of the stigma. In fact, during the questioning, we had the interview with the Vice President of Tata Motors, and that also the entire  thing was very positive, but only the fact that Hyundai dealership was terminated, because of which finally we did not get the dealership to Tata Motors.\n\nJustice Kannan, Arbitrator\nApart from that, this is something else which you can attribute a so-called loss of goodwill. You're saying cancellation of your other dealership it is lost? That's all you're talking and that’s the example you will get.\n\nSaral Talwar\nApart from that, we could have, you know, because of this, most financers withdrew the funding that they had given us and started cutting down our limits, because they wouldn't trust us anymore. So, because of which ultimately, we had to close sales for IShore also because we were not getting funding anywhere and all the fundings were exhausted by all the financers.\n\nKalyan Jhabakh\nI put it to you that you're not entitled to the claim of the litigation expenses as stated herein.\n\nSaral Talwar\nI deny it."
	  },
	  {
		"id": 11,
		"start": "6544",
		"end": "7090",
		"text": "Justice Kannan, Arbitrator\nWhen you're talking about litigation expenses, you're talking about the expenses to the lawyer, expenses to arbitrator, and what other items of expenditure would you think?\n\nSaral Talwar\nAll those, sir. So, starting from our stay petition to all the expenses that we have incurred to reach here, in the High Court \n\nKalyan Jhabakh\nI put it to you, that in spite of several opportunities being given to correct the mistakes done to the claimant and the failure of the response of the claimant to close the funding gap and pick up sales, the respondent has rightly and legally terminated the dealership.\n\nSaral Talwar\nI deny this claim. We were given, obviously, there were a lot of exchanges earlier, but the actual encryption when it was happening, and the time of actually show-cause notice and termination was a time when there could be nothing done by anybody in the country thanks to the situation and the pandemic in the country. And that is when they went ahead and terminated the dealership. So, technically speaking, I think the main time when the time should have been given was actually not given\n\nKalyan Jhabakh\n Please see Exhibit C26. Please take page number 123. In the last third column of buildings in the year 01/04/2018, you are told there's been a deletion of 5 crores 81 lakhs. Can you explain what this deletion means, in buildings?\n\nSaral Talwar\nThere was one property, Sanathnagar, which was earlier belonging to Talwar Motors Private Limited, which got transferred to a group company and for which we have gotten the funds. So, that property was sold. There was a sale of the property, there was a building that got sold.\n\nJustice Kannan, Arbitrator\nI still don't understand what are we talking about, if you're selling one of the items or properties of which you're holding, what is the deletion you're talking about? That asset is not any longer available in the company, that’s what you want to say?\n\nSaral Talwar\nThat’s right. And in the balance sheet, it has been removed. There was an asset of five crores, which got sold. So, it is no longer an asset of the company. So, that's what is a deletion of the asset.\n\nJustice Kannan, Arbitrator\nSo, there should be correspondingly an amount of cash coming into the company by sale of the property.\n\nSaral Talwar\nYes.\n\nJustice Kannan, Arbitrator\nAnd it should be reflected as cash in hand or something like that?\n\nSaral Talwar\nI mean the money coming in and whatever the utilization of sale, it was properly, it would be properly accounted.\n\nKalyan Jhabakh\nIn respect of the free services for cars sold by a dealer, I put it to you that is with three free services a part of the obligation of the dealer in respect of cars sold by it and nothing is payable by the claimant independently for that. What do you say?\n\nSaral Talwar\nI deny that. Every company pays the dealers for the free servicing. In case of Hyundai, they normally pay us along with the sale margin of the car. Though, it is normally shown separately also that this much margin is paid towards the free servicing of the vehicles. Some, manufacturers paid separately, and Hyundai includes it in the margin of the car at the time of sale.\n\nJustice Kannan, Arbitrator\nWill you, therefore, say pre-servicing is free for the customer or the person, but as far as the company is concerned, it still involves an expenditure. And that is at every time when you sell the car, there is an inbuilt cost there, which is there, which the company, the manufacturer will shoulder having sold the car.\n\nSaral Talwar\nThat is correct, sir. So, every free service for any manufacturer, it is always either included in the commission paid to the dealer or paid separately, different companies work different ways. So, in Hyundai, they normally included in our initial sale commission and don't give us separately.\n\nKalyan Jhabakh\n Is the understanding correct that apart from that for the said three free services, no independent money is payable by Hyundai to the dealer, and it is the obligation of the dealer to service, to do carry out the three free services for the cars given, sold by it?\n\nSaral Talwar\nNo, that's not the way it is. In case, in fact, just to give an explanation, I'll explain to you in a slightly better way you'll be able to get clarity. If I sell a car and I do the free service for it, the money for free service is assumed to have been paid to me in the time of sale itself, but if the vehicle is sold by any other dealer, at Talwar Hyundai there is a vehicle that is sold by Lakshmi Hyundai, and it comes to my workshop for a free service, I collect the free service coupon and I actually raise a bill to Lakshmi Hyundai and Lakshmi Hyundai physically pays me money for it. So, there is a full payment done. So, if I service vehicles of any other dealer, I raise a bill to them. If they service a vehicle sold by me, they raise a bill to me, and I make payment to them. Because Hyundai says we made payment at the time of sale.\n\nJustice Kannan, Arbitrator\nTherefore, if a particular car comes to you, you buy it from Hyundai and you avail to the person a free service. You don't claim a free service coupon against the manufacturer because the assumption is that it's billed in the cost of the vehicle itself. The free service coupons come only when it is brought to you by a person where some other dealer had sold the car because the free coupons will always be therefore spoken in the context of a car coming to you for service when you have not yourself sold the car to another to another person. Is that right?\n\nSaral Talwar\nEvery car has a free service coupon inbuilt with it, sir and at the time of sale, the selling dealer puts his stamp on it. So, if my own car comes to me, I don't have to raise a claim with anybody, I pass it on as a free service and I have to close it at a zero bill. If I get a car from any other dealer which has a stamp of any other dealer, then I have to raise a bill and claim that money from the respective dealer.\n\nJustice Kannan, Arbitrator\nIt doesn't go to the manufacturer.\n\nSaral Talwar\nIt doesn't go to the manufacturer. And, just to add here, sir, this entire process is also done through the Hyundai software itself. The claims are raised through the software to the respective dealer and the dealer physically sends cheques to each other for the amount."
	  },
	  {
		"id": 12,
		"start": "7158",
		"end": "7703",
		"text": "Justice Kannan, Arbitrator\nDo you continue to service cars now after the termination of dealership of what you have sold?\n\nSaral Talwar\nNo, sir. We are servicing whatever cars come to us, but nothing to do with the free service. We can’t do free service anymore. We are just doing general paid services of Hyundai and any other car that comes to our workshop.\n\nJustice Kannan, Arbitrator\nNow, therefore, if the car of what you have sold where you won't be able to do that service and he goes to another person, and he does the service. You said now, whoever has sold it, they will raise the bill against you. Will that person, so to say, if it is some other Lakshmi dealer, will he raise a bill on you and you will collect it or will he raise it against the company and take it?\n\nSaral Talwar\nNow that I'm not a dealer, I think they will have to send the claim to Hyundai and from there it'll come back to me.\n\nJustice Kannan, Arbitrator\nOr it will be again collected from you.\n\nSaral Talwar\nUltimately, Hyundai would say, yes, I would be, yes.\n\nJustice Kannan, Arbitrator\nIn all cases, where there is a termination and where the car is serviced by somebody else other than you, and if they won't raise it against the dealer whose dealership is terminated, they will have to perforce, raise it against that company, and you expect the company to raise it against you. That is what you see?\n\nSaral Talwar\nThat is what I think will happen.\n\nJustice Kannan, Arbitrator\nAnd that's what, therefore it is possible for, if the dealership is wrongfully terminated. Therefore, I take it to the next question. If the dealership is wrongfully terminated, then this question does not arise. If the dealership is properly terminated, the expectation of the manufacturer to take the value of the free services of the of those vehicles or whatever would have been billed, or what some other person has billed against the company, will be entitled to recover it from you, is that right?\n\nSaral Talwar\nIn case it is, I mean rightfully terminated, then yes, you're right, sir. That that money would be payable by the dealer to Hyundai because Hyundai says they have already made this payment to you. So, technically that is correct, sir.\n\nKalyan Jhabakh\nPlease take Exhibit R62, Page 251, Respondent Typeset. I put it to you that this is the list of the vehicles which had been sold by the Claimant and in which some of the services are still pending, and that is the claim that the Respondent is making as against you for the INF claims.\n\nSaral Talwar\nI deny this complete fact, I think Hyundai is trying to, you know, fleece money, as Hyundai also knows that the free services are for three months, six months and one year of a sale of the car. If you see in the claim, sir, they have claimed for vehicles that have been sold in 2015, 2012, 2013, which they know anyway even if the car comes today for free service, these claims are not tenable.\nOnly yes, to the certain extent probably that vehicle that was sold less than one year from the date of termination, definitely would be now that would be justified if it has not come, but that also as you see from the list, never ever does it happen that 100% vehicles come back for free service. If you see as per their own list, they are showing vehicles from 2012, 2013, 2014 which have not come back for free service.\n\nJustice Kannan, Arbitrator\nLike you said if the termination is lawful and if the free service is available only for a period of one year in in various tranches, then the claim in respect of those vehicles for the money equivalent to the free service will be tenable, otherwise in respect of any other claim, it will not be tenable. Shall I take it like that?\n\nSaral Talwar\nYour point is very right, sir, if it is a rightful termination. Since we are saying it is not a rightful termination, we are not liable for anything, but in that I'm just specifying that the way they have tried to make the claim, they have taken every vehicle sold by us over 25 years literally and telling us that those free services are pending, and we need to pay for them. Whereas we know that after one year, in fact, we ourselves don't entertain today, maybe one month, two month grace is given to a customer, but more than that, we don't entertain the free service if the customer comes beyond that date.\n\nKalyan Jhabakh\nI put it to you that apart from Hyundai, that is the Respondent, the Claimant is also supposed to maintain records of its sales and that is why it would have all the particulars of the vehicles, which free services are still to be done which have been sold by it.\n\nSaral Talwar\nAs I said yes, we do have a record of vehicles that we have to service, but once the particular \nservice goes beyond the due date, maximum, we give a leverage of about a month. Hyundai  \nactually doesn't say to give any leverage. As per Hyundai if the vehicle doesn't report in time for \nthe free service, the free service is not applicable to the customer.So, but still, we normally go ahead and give about a month's leverage to a customer, beyond that we don't.  \nAnd, basically just to add here, sir, I mean if you see the list what Hyundai has given, \nthey have given some vehicles that were sold in 2009, 2010. So, what I'm saying is today the \nvehicle would have probably done 10 other services. He will not come back for first free service \nand second free service."
	  },
	  {
		"id": 13,
		"start": "8260",
		"end": "8642",
		"text": "Kalyan Jhabakh\nI put it to you that the Claimant was a distributor in Mobis India and has been supplying spareparts of the Respondent company's cars to other dealers also. And, you have deliberately madea false statement.\n\nSaral Talwar\nYour statement is 100% wrong and denied. Firstly, the Claimant is not the distributor for Mobis. The distributor for Mobis is my group company called Talwar Trading Company and Talwar Trading is not a not a distributor of Mobis, and Talwar Trading cannot sell to any Hyundai dealer, let alone Talwar Hyundai also. Not a single rupee of part ever is sold by Talwar Trading to Talwar Hyundai. The Talwar Trading is a pure distributor of Mobis only for open market. So, the Talwar Trading sells only to non-dealers of Hyundai that is to local mechanics, garages, and normal local workshops. In fact, even if I sell like five rupees of part to Talwar Hyundai, it is not even included in my sale target of the Talwar Mobis which is a completely different entity, and it's a complete different business. Not a single part, I mean maybe if something is short, I would have probably taken some 5,000 to 10,000 parts sometimes from Talwar Mobis for convenience sake, but otherwise all purchases of Talwar Hyundai or Talwar Mobis Private Limited, which is the Claimant company has always been from Mobis India directly and never from Talwar Trading.\n\nKalyan Jhabakh\nI put it to you since your group company is fully aware as regard to the spares and accessories of the Respondent company being dealt with by a separate legal entity, you are not entitled to this claim from the Respondent.\n\nSaral Talwar\nI completely deny this. Talwar Trading has a specific agreement with Mobis India and Mobis India has appointed Talwar Trading as a distributor. Mr Kalyan, if I can continue. And Talwar Hyundai  or Talwar Mobis Private Limited has never ever entered any agreement with Hyundai Motors, which I can reiterate.\n\nKalyan Jhabakh\nI put it to you that the current SBI interest rate for a one-year term deposit is only about 4.40% per annum.\n\nSaral Talwar\nI don't know, sir, I have not put any deposit lately, so I'm not aware it.\n\nKalyan Jhabakh\nI put it to you, that since end of 2018 and in the entire year of 2019, since the Claimant failed to comply with the requirements of the dealership agreement by infusion of funds and increasing its sales, the Respondent has rightfully and lawfully terminated the dealership.\n\nSaral Talwar\nI completely deny this claim. I don't think it is true.\n\nKalyan Jhabakh\nI put it to you, that in terms of Clause 13.1 of the Dealership Agreement, Page 109, the Respondent is entitled to terminate the Dealership Agreement by giving 30 days’ notice, the same being a Commercial Contract entered into between the parties without assigning any reason.\n\nJustice Kannan, Arbitrator\nWithout assigning any reason because you already asked the question that justified in past seven days. They said, no or the contract you can do it, but always that may not happen. He is now asking a larger question as per another clause.\n\nSaral Talwar\nAs per the agreement, what you are saying is true, sir, but as I said this agreement was, we had no choice but to sign this agreement with this clause. Had we had a choice, we would never have agreed to this clause.\n\nKalyan Jhabakh\nI put it to you, that the entire claim made by the Claimant is not maintainable and is liable to be dismissed.\n\nSaral Talwar\nI completely disagree with him."
	  }
	]
  }